In [1]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.11/dist-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in /usr/local/lib/python3.11/dist-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.11/dist-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.11/dist-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.11/dist-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.11/dist-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [5]:
s = pd.Series([1, 2, 3])

In [6]:
s

0    1
1    2
2    3
dtype: int64

In [7]:
s + [1000, 2000, 3000]

0    1001
1    2002
2    3003
dtype: int64

In [8]:
s + 1000

0    1001
1    1002
2    1003
dtype: int64

In [9]:
s < 0

0    False
1    False
2    False
dtype: bool

In [11]:
s = pd.Series([183, 170, 200], index=["ali", "sara", "mahdi"])
s

ali      183
sara     170
mahdi    200
dtype: int64

In [12]:
s["ali"]

np.int64(183)

In [13]:
s[0]

/tmp/ipython-input-13-243613605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

np.int64(183)

In [14]:
s.loc["ali"]

np.int64(183)

In [15]:
s.iloc[0]

np.int64(183)

In [16]:
wieght = {
    "mohammad" : 80,
    "melina" : 59,
    "bob" : 90
}
pd.Series(wieght)

mohammad    80
melina      59
bob         90
dtype: int64

In [17]:
pd.Series(wieght, index = ["melina", "bob"])

melina    59
bob       90
dtype: int64